
[
  {
    "title": ["Pronouns"],
    "posturl": ["pronouns"],
    "cover": ["url(https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Flag_of_Ireland.svg/383px-Flag_of_Ireland.svg.png)"],
    "content": ["Pronouns are words that take the place of a noun. In English, there are more than 100 pronouns. Some of the more commonly used pronouns are: I / You / He / She etc.. In Irish, they are only 7 pronouns to remember. They are: -n- - Mé: I -n- - Tú: You -n- - Sé/é: He / him it -n- - Sí/í: She/her/it -n- - Sinn/muid: We/ Us -n- - Sibh: You (plural) Ye -n- - Siad/iad: They/them -n- -b Note: -e  -n- Muid is commonly used all around Ireland, and sinn is used around areas of Munster."],
    "tags": [641]
  },
  {
    "title": ["The Copula"],
    "posturl": ["copula"],
    "cover": ["url(https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Flag_of_Ireland.svg/383px-Flag_of_Ireland.svg.png)"],
    "content": ["If there is one thing that you should learn when staring to learn Irish is the copula. -n- It is used to describe a persons characteristics in Irish. -n- This means that the word order would be -b noun + adjective + subject -e -n- When you construct a copula sentence, you need to remember these three things. The copula,  -b IS -e -, the  -b object -e, and the -b subject -e, which is often a pronoun. -n-E.g. -bIs -e(Particle) -bduine falsa-e -bmé-e (subject) -n-Which translates to -i I am a lazy person -e-n--bWords to remember -e:-n--bcairdiúil -e - friendly -n--bspóirtiúil -e - sporty"],
    "tags": [1]
  },
  {
    "title": ["Irregular verbs"],
    "posturl": ["irregular"],
    "cover": ["url(https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Flag_of_Ireland.svg/383px-Flag_of_Ireland.svg.png)"],
    "content": ["Unlike most languages, Irish only has a handful of irregular verbs. Although, like most lanfuages, the irregular verbs are the most common verbs because words evolve the most when they get spoken the most. Apart from a few exceptions, -bIrregular verbs have the same endings as the regular verbs. It’s just the stem that changes.-e To remember them, try and speak these words out loud for a week or so. Effortless memorisation. -h -n- - Abair: to say -n- - Beir: catch / give birth to -n- - Clois: to hear -n- - Déan: to make/do -n- - Faigh: to get -n- - Feic: to see -n- - Ith: to eat -n- - Tabhair: to give -n- - Tar: to come -n- - Teigh: go -n- - Bí: to be"],
    "tags": [289]
  },
  {
    "title": ["The colours"],
    "cover": ["url(https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Colouring_pencils.jpg/450px-Colouring_pencils.jpg)"],
    "posturl": ["colours"],
    "content": ["This table provides each basic Irish colour with its English translation. Take a look below: -n- -t- -tr- -th- Irish -eth- -th- English -eth- -etr- -tr- -td- Dearg -etd- -td- Red -etd- -etr- -tr- -td- Buí -etd- -td- Yellow -etd- -etr- -tr- -td- Gorm -etd- -td- Blue -etd- -etr- -tr- -td- Oráiste -etd- -td- Orange -etd- -etr- -tr- -td- Glas -etd- -td- Green -etd- -etr- -tr- -td- Corcra -etd- -td- Purple -etd- -etr- -tr- -td- Bándearg -etd- -td- Pink -etd- -etr- -tr- -td- Liath -etd- -td- Grey -etd- -etr- -tr- -td- Bán -etd- -td- White -etd- -etr- -tr- -td- Donn -etd- -td- Brown -etd- -etr- -tr- -td- Dubh -etd- -td- Black -etd- -etr- -et- -n--bNotes: -e -n-Some colours have special words according to the context. Dearg is red, but to describe hair, you use the word rua. -n-E.g. -b Tá gruaig rua aici-e: She has red hair. Green on the Irish flag also has a special name. Uaine. "],
    "tags": [2]
  },
  {
    "title": ["School Facilities(w.i.p)"],
    "posturl": ["school"],
    "cover": ["url(http://www.irishwarmemorials.ie/images/1410_med.jpg)"],
    "content": ["This table provides each basic Irish school facility with its English translation. Take a look below: -n- -t- -tr- -th- Irish -eth- -th- English -eth- -etr- -tr- -td- Saotharlann -etd- -td- Science Lab -etd- -etr- -tr- -td- Cistin -etd- -td- Kitchen -etd- -etr- -tr- -td- Seomra ealaín -etd- -td- Art room -etd- -etr- -tr- -td- Oráiste -etd- -td- Orange -etd- -etr- -tr- -td- Glas -etd- -td- Green -etd- -etr- -tr- -td- Corcra -etd- -td- Purple -etd- -etr- -tr- -td- Bándearg -etd- -td- Pink -etd- -etr- -tr- -td- Liath -etd- -td- Grey -etd- -etr- -tr- -td- Bán -etd- -td- White -etd- -etr- -tr- -td- Donn -etd- -td- Brown -etd- -etr- -tr- -td- Dubh -etd- -td- Black -etd- -etr- -et- -n--bNotes: -e -n-Some colours have special words according to the context. Dearg is red, but to describe hair, you use the word rua. -n-E.g. -b Tá gruaig rua aici-e: She has red hair. Green on the Irish flag also has a special name. Uaine. "],
    "tags": [2]
  },
  {
    "title": ["Hangman"],
    "posturl": ["hangman"],
    "cover": ["url(https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQU8rrHV22pP4_W0OUQZDuOhK9sxuntF9EYze0deTEY_FT01FhN1g8oMtgDEiQ4u-KUpck&usqp=CAU)"],
    "content": ["Play Irish Hangman"],
    "tags": [1024]
  }
]
